DataProcessors/питЗагрузкаИзДанныхПродажФронта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питЗагрузкаИзДанныхПродажФронта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассовыйУзел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.питУдаленныеКассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаОтбора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаКонцаОтбора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЦелевыхДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппироватьПоНомеруСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходящаяСмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВпередДляАнализаПерехода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейНазадДляАнализаПерехода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>удалитьУчитыватьВозвратыПриЗагрузкеПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдминистративныйРежимПерезагрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФиксированнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПараметрыКасс</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДанныеМодифицированы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СпособОпределенияСкладаПриготовления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СпособОпределенияСкладаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СкладПриготовления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СкладРеализации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗагрузкаДанныхПродажВПроизводственныеДокументы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УчитыватьОстаткиБлюдНаСкладе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроводитьЗагружаемыеДокументы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗапретитьПовторнуюЗагрузкуДанныхПродаж</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РазрешитьНедовложения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗагружатьТоварыВВыпускСПеремещением</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОрганизацияЦелевыхДокументовИзКассыККМ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОрганизацияКассовогоУзла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УчитыватьВозвратыПриЗагрузкеПродаж</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПодразделениеКассовогоУзла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УменьшатьСуммыТоваровНаСуммуБонусов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОформлятьДокументыИСМП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОформлятьДокументыЕГАИС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/питЗагрузкаИзДанныхПродажФронта/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ПересчитатьТаблицуДокументовИКасс;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Инициализация();
	Элементы.ТаблицаОбрабатываемыхДокументовКассовыйУзел.Видимость = НЕ ЗначениеЗаполнено(Объект.КассовыйУзел);
	Модифицированность = Ложь;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	питИзменениеОтраслевыхФормСервер.ПриСозданииНаСервереВНачале(ЭтаФорма, Отказ, СтандартнаяОбработка);
	ЗагрузитьПараметрыКассККМ();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗагрузкуДанных()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СписокОтключенныхДокументов = СписокОтключенныхДокументов;
	Возврат ОбработкаОбъект.ВыполнитьЗагрузкуДанных();
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ


&НаСервере
Процедура Инициализация()
	// по умолчанию
	//Если ЗаполнятьНастройкиПоУмолчанию Тогда
		Объект.ДатаЦелевыхДокументов = 1;
		Объект.ГруппироватьПоНомеруСмены = Истина;
		Объект.ПереходящаяСмена = Истина;
		Объект.ДнейВпередДляАнализаПерехода = 1;
		Объект.ДнейНазадДляАнализаПерехода = 1;
		ВыводитьОтчетОСохраненныхДокументах = Истина;
	//КонецЕсли;
	
	Объект.ДатаКонцаОтбора = ТекущаяДата();
	Объект.Организация = питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Если Объект.ГруппироватьПоНомеруСмены Тогда
		Элементы.ПереходящаяСмена.Доступность = Истина;
	Иначе
		Объект.ПереходящаяСмена = Ложь;
	КонецЕсли;
	Элементы.ДнейНазадДляАнализаПерехода.Доступность = Объект.ПереходящаяСмена;
	Элементы.ДнейВпередДляАнализаПерехода.Доступность = Объект.ПереходящаяСмена;
	Объект.ФиксированнаяДата = ТекущаяДата();
	Элементы.ФиксированнаяДата.Доступность = Объект.ДатаЦелевыхДокументов = 2;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыКассККМ()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьПараметрыКассККМ();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументовДляЗагрузки(СписокИсключающихДокументов = Неопределено)
	
	Если СписокИсключающихДокументов = Неопределено Тогда
		СписокИсключающихДокументов = Новый СписокЗначений;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	// Список документов, которые отключил пользователь
	ОбработкаОбъект.СписокОтключенныхДокументов = Новый СписокЗначений;
	
	СтрокиОтключенныхДокументов = ТаблицаОбрабатываемыхДокументов.НайтиСтроки(Новый Структура("Использовать", Ложь));
	ТаблицаОтключенных = ТаблицаОбрабатываемыхДокументов.Выгрузить(СтрокиОтключенныхДокументов, "Документ");
	
	ОбработкаОбъект.СписокОтключенныхДокументов.ЗагрузитьЗначения(ТаблицаОтключенных.ВыгрузитьКолонку("Документ"));
	
	// Очистим таблицу
	ТаблицаОбрабатываемыхДокументов.Очистить();
	// Проверим корректность
	ОбработкаОбъект.ПроверитьКорректность(Ложь);
	
	// Выделяем массив документов с неподдерживаемой хоз операцией.
	МассивНеподдерживаемыхДокументов = МассивНеподдерживаемыхДокументов(ОбработкаОбъект.СписокИсключающихДокументов.ВыгрузитьЗначения());
	
	// Загружаем список исключающих документов.
	ОбработкаОбъект.СписокИсключающихДокументов.ЗагрузитьЗначения(СписокИсключающихДокументов.ВыгрузитьЗначения());
	
	// Добавляем в список исключающих документов найденные неподдерживаемые.
	Для каждого НеподдерживаемыйДокумент Из МассивНеподдерживаемыхДокументов Цикл
		Если ОбработкаОбъект.СписокИсключающихДокументов.НайтиПоЗначению(НеподдерживаемыйДокумент) = Неопределено Тогда
			ОбработкаОбъект.СписокИсключающихДокументов.Добавить(НеподдерживаемыйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДокументов = ОбработкаОбъект.ПолучитьДокументыДляОбработки();
	ТаблицаДокументов.Свернуть("Дата, Документ, ДокументПредставление, Использовать, КассаККМ, КассовыйУзел, НеОбрабатывать, ЭтоОтключенныйДокумент");
	ТаблицаОбрабатываемыхДокументов.Загрузить(ТаблицаДокументов);
	
	СписокОтключенныхДокументов = ОбработкаОбъект.СписокОтключенныхДокументов.Скопировать();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	ПересчитатьТаблицуДокументовИКасс = Ложь;
КонецПроцедуры

&НаСервере
Функция МассивНеподдерживаемыхДокументов(МассивДокументов = Неопределено)
	
	Результат = Новый Массив;
	
	// Если массив документов не был передан - получим его из таблицы документов.
	Если МассивДокументов = Неопределено Тогда
		МассивДокументов = ТаблицаОбрабатываемыхДокументов.Выгрузить(,"Документ").ВыгрузитьКолонку("Документ");
	КонецЕсли;
	
	// Фильтр массива документов, оставляем только неподдерживаемые операции.
	ВидыОперацийДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивДокументов, "ВидОперации");
	Для каждого ТекДокумент Из МассивДокументов Цикл
		Если НЕ ВидыОперацийДокументов.Получить(ТекДокумент) = Перечисления.питХозяйственныеОперации.ДанныеПродажФронтаНеподдерживаемаяОперация Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(ТекДокумент);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Сохранет изменения для кассового узла
&НаСервере
Процедура СохранитьИзмененияКассовогоУзла(ИдентификаторСтроки)
	текСтрокаНастроек = Объект.ПараметрыКасс.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если текСтрокаНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если текСтрокаНастроек.ДанныеМодифицированы Тогда
		текКассовыйУзел = текСтрокаНастроек.КассаККМ.питКассовыйУзел;
		Если НЕ ЗначениеЗаполнено(текКассовыйУзел) Тогда
			ТекстСообщения = "Не удалось сохранить настройки для "+текСтрокаНастроек.КассаККМ + ". Кассовый узел не заполнен";
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			Возврат
		КонецЕсли;
		текКассовыйУзелОбъект = текКассовыйУзел.ПолучитьОбъект();
		текКассовыйУзелОбъект.СкладПриготовления 								= текСтрокаНастроек.СкладПриготовления;
		текКассовыйУзелОбъект.СкладРеализации 									= текСтрокаНастроек.СкладРеализации;
		текКассовыйУзелОбъект.ЗагрузкаДанныхПродажВПроизводственныеДокументы 	= текСтрокаНастроек.ЗагрузкаДанныхПродажВПроизводственныеДокументы;
		текКассовыйУзелОбъект.УчитыватьОстаткиБлюдНаСкладе 						= текСтрокаНастроек.УчитыватьОстаткиБлюдНаСкладе;
		текКассовыйУзелОбъект.ПроводитьЗагружаемыеДокументы 					= текСтрокаНастроек.ПроводитьЗагружаемыеДокументы;
		текКассовыйУзелОбъект.ЗапретитьПовторнуюЗагрузкуДанныхПродаж 			= текСтрокаНастроек.ЗапретитьПовторнуюЗагрузкуДанныхПродаж;
		текКассовыйУзелОбъект.СпособОпределенияСкладаПриготовления 				= текСтрокаНастроек.СпособОпределенияСкладаПриготовления;
		текКассовыйУзелОбъект.СпособОпределенияСкладаРеализации 				= текСтрокаНастроек.СпособОпределенияСкладаРеализации;
		текКассовыйУзелОбъект.РазрешитьНедовложения 							= текСтрокаНастроек.РазрешитьНедовложения;
		текКассовыйУзелОбъект.ЗагружатьТоварыВВыпускСПеремещением				= текСтрокаНастроек.ЗагружатьТоварыВВыпускСПеремещением;
		Попытка
			текКассовыйУзелОбъект.Записать();
			текСтрокаНастроек.ДанныеМодифицированы = Ложь;
		Исключение
			ТекстСообщения = "Не удалось сохранить настройки для "+текСтрокаНастроек.КассаККМ;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура УстановитьФлажкиДокументы(Команда)
	УстановитьСнятьФлажкиДокументов()
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиДокументы(Команда)
	УстановитьСнятьФлажкиДокументов(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажкиДокументов(Значение = Истина)
	Для Каждого ТекСтрока Из ТаблицаОбрабатываемыхДокументов Цикл
		Если ТекСтрока.НеОбрабатывать Тогда
			Продолжить;
		Иначе
			ТекСтрока.Использовать = Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиКасс(Команда)
	Для Каждого СтрокаТаблицы Из Объект.ПараметрыКасс Цикл
		СтрокаТаблицы.Использовать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиКасс(Команда)
	Для Каждого СтрокаТаблицы Из Объект.ПараметрыКасс Цикл
		СтрокаТаблицы.Использовать = Ложь;
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура ПараметрыКассПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.ПараметрыКасс.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ГруппаНастройкиВыпускаПродукции.Видимость = ТекСтрока.ЗагрузкаДанныхПродажВПроизводственныеДокументы;
	НастройкиВыпускаПродукции.Очистить();
	Если ТекСтрока.ЗагрузкаДанныхПродажВПроизводственныеДокументы Тогда
		СтруктураНастроек = Новый Структура("РазрешитьНедовложения, УчитыватьОстаткиБлюдНаСкладе, ЗагружатьТоварыВВыпускСПеремещением", "Разрешить недовложения","Учитывать остатки блюд на складе","Загружать товары в выпуск с перемещением");
		//СтруктураНастроек = Новый Структура("РазрешитьНедовложения, УчитыватьОстаткиБлюдНаСкладе", "Разрешить недовложения","Учитывать остатки блюд на складе");
		
		Для Каждого КолонкаСтроки Из СтруктураНастроек Цикл
			
			НоваяНастройка = НастройкиВыпускаПродукции.Добавить();
			НоваяНастройка.ЗаголовокКолонки = КолонкаСтроки.Значение;
			НоваяНастройка.ИмяКолонки = КолонкаСтроки.Ключ;
			НоваяНастройка.Значение = ТекСтрока[КолонкаСтроки.Ключ];
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВыпускаПродукцииЗначениеПриИзменении(Элемент)
	ТекСтрокаНастроек = Элементы.ПараметрыКасс.ТекущиеДанные;
	ТекСтрокаНастроекВыпуска = Элементы.НастройкиВыпускаПродукции.ТекущиеДанные;
	Если ТекСтрокаНастроек = Неопределено ИЛИ ТекСтрокаНастроекВыпуска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСтрокаНастроек[ТекСтрокаНастроекВыпуска.ИмяКолонки] = ТекСтрокаНастроекВыпуска.Значение;
	ТекСтрокаНастроек.ДанныеМодифицированы = Истина;
	ПересчитатьТаблицуДокументовИКасс = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКассЗагрузкаДанныхПродажВПроизводственныеДокументыПриИзменении(Элемент)
	ПараметрыКассПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДокументов(Команда)
	ЗаполнитьСписокДокументовДляЗагрузки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбрабатываемыхДокументовИспользоватьПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаОбрабатываемыхДокументов.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекСтрока.НеОбрабатывать Тогда
		ТекСтрока.Использовать = Ложь;
	КонецЕсли;
	ПересчитатьТаблицуДокументовИКасс = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДатаЦелевыхДокументовПриИзменении(Элемент)
	Элементы.ФиксированнаяДата.Доступность = Объект.ДатаЦелевыхДокументов = 2;
	Если НЕ ЗначениеЗаполнено(Объект.ФиксированнаяДата) И Объект.ДатаЦелевыхДокументов = 2 Тогда
		Объект.ФиксированнаяДата = ТекущаяДата();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФиксированнаяДатаПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ФиксированнаяДата) Тогда
		Объект.ФиксированнаяДата = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КассовыйУзелПриИзменении(Элемент)
	ЗагрузитьПараметрыКассККМ();
	Элементы.ТаблицаОбрабатываемыхДокументовКассовыйУзел.Видимость = НЕ ЗначениеЗаполнено(Объект.КассовыйУзел);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКассПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПересчитатьТаблицуДокументовИКасс = Истина;
	текСтрокаНастроек = Элементы.ПараметрыКасс.ТекущиеДанные;
	Если текСтрокаНастроек <> Неопределено Тогда
		текСтрокаНастроек.ДанныеМодифицированы = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПоНомеруСменыПриИзменении(Элемент)
	Элементы.ПереходящаяСмена.Доступность = Объект.ГруппироватьПоНомеруСмены;
	Если НЕ Объект.ГруппироватьПоНомеруСмены И Объект.ПереходящаяСмена Тогда
		Объект.ПереходящаяСмена = Ложь;
		ПереходящаяСменаПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереходящаяСменаПриИзменении(Элемент)
	Элементы.ДнейНазадДляАнализаПерехода.Доступность = Объект.ПереходящаяСмена;
	Элементы.ДнейВпередДляАнализаПерехода.Доступность = Объект.ПереходящаяСмена;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	// Заполним список документов для исключения
	СписокИсключающихДокументов = Новый СписокЗначений;
	
	// Если надо, перезаполним документы для загрузки
	Если ПересчитатьТаблицуДокументовИКасс Тогда
		ЗаполнитьСписокДокументовДляЗагрузки();
	КонецЕсли;

	Если ТаблицаОбрабатываемыхДокументов.НайтиСтроки(Новый Структура("Использовать",Истина)).Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет документов, предназначенных для обработки.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	// Загрузим данные в целевые документы
	СтруктураОбработанныхДокументов = ВыполнитьЗагрузкуДанных();
	// Если надо, выведем отчет
	Если СтруктураОбработанныхДокументов.Свойство("МассивСохраненныхДокументов") Тогда
		МассивСохраненныхДокументов = СтруктураОбработанныхДокументов.МассивСохраненныхДокументов;
	Иначе
		МассивСохраненныхДокументов = Новый Массив;
	КонецЕсли;
	Если СтруктураОбработанныхДокументов.Свойство("МассивУдаленныхДокументов") Тогда
		МассивУдаленныхДокументов = СтруктураОбработанныхДокументов.МассивУдаленныхДокументов;
	Иначе
		МассивУдаленныхДокументов = Новый Массив;
	КонецЕсли;
	Если СтруктураОбработанныхДокументов.Свойство("СписокИсключающихДокументов") Тогда
		СписокИсключающихДокументов.ЗагрузитьЗначения(СтруктураОбработанныхДокументов.СписокИсключающихДокументов.ВыгрузитьЗначения());
	КонецЕсли;
	Если ВыводитьОтчетОСохраненныхДокументах И (МассивСохраненныхДокументов.Количество() + МассивУдаленныхДокументов.Количество()) > 0 Тогда
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("МассивСохраненныхДокументов", МассивСохраненныхДокументов);
		ПараметрыПечати.Вставить("МассивУдаленныхДокументов", МассивУдаленныхДокументов);
		
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
			МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
			МодульУправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.питЗагрузкаИзДанныхПродажФронта", "РезультатРаботы", 
				МассивСохраненныхДокументов, ЭтотОбъект, ПараметрыПечати);
		КонецЕсли;
	КонецЕсли;
	// Перезаполним список документов с учетом обновлений регистра учета данных продаж
	ЗаполнитьСписокДокументовДляЗагрузки(СписокИсключающихДокументов);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПоКассовымУзлам(Команда)
	
	Если Объект.ПараметрыКасс.Количество() = 0 Тогда
		ЗаполнитьНастройкиПоКассовымУзлам_Фрагмент();
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНастройкиПоКассовымУзламЗавершение", ЭтотОбъект), "Перезаполнить кассы ККМ значениями по умолчанию",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПоКассовымУзламЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если  РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ЗаполнитьНастройкиПоКассовымУзлам_Фрагмент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПоКассовымУзлам_Фрагмент()
	
	ЗагрузитьПараметрыКассККМ();
	Элементы.ПараметрыКасс.Обновить();
	ПараметрыКассПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьНастройкиПоКассовомуУзлу(Команда)
	ТекСтрока = Элементы.ПараметрыКасс.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаПараметров Из Объект.ПараметрыКасс Цикл
		ЗаполнитьЗначенияСвойств(СтрокаПараметров,ТекСтрока,,"КассаККМ,Использовать")
	КонецЦикла;
	Элементы.ПараметрыКасс.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПараметрыКасс(Команда)
	// спросим об очистке и если "Да", то очистим
	Если Объект.ПараметрыКасс.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьПараметрыКассЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,"Очистка таблицы");
		Возврат;
	КонецЕсли;
	
	ОчиститьПараметрыКассФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПараметрыКассЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ПараметрыКасс.Очистить();
	КонецЕсли;
	
	ОчиститьПараметрыКассФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПараметрыКассФрагмент()
	
	Если Объект.ПараметрыКасс.Количество() = 0  Тогда
		Элементы.НастройкиВыпускаПродукции.Видимость = Ложь;
		НастройкиВыпускаПродукции.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиПоКассовомуУзлу(Команда)
	текСтрокаНастроек = Элементы.ПараметрыКасс.ТекущиеДанные;
	Если текСтрокаНастроек <> Неопределено Тогда
		СохранитьИзмененияКассовогоУзла(текСтрокаНастроек.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиПоКассовымУзлам(Команда)
	Для Каждого СтрокаНастроек Из Объект.ПараметрыКасс Цикл
		СохранитьИзмененияКассовогоУзла(СтрокаНастроек.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбрабатываемыхДокументовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.ТаблицаОбрабатываемыхДокументов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	текКолонка = Элементы.ТаблицаОбрабатываемыхДокументов.ТекущийЭлемент;
	
	Если текКолонка.Имя = "ТаблицаОбрабатываемыхДокументовДокументПредставление" И ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
		ПредставлениеДокумента = Строка(ТекущиеДанные.Документ);
		Если ТекущиеДанные.ДокументПредставление <> ПредставлениеДокумента Тогда
			ТекущиеДанные.ДокументПредставление = ПредставлениеДокумента;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОбрабатываемыхДокументовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ТаблицаОбрабатываемыхДокументов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	текКолонка = Элементы.ТаблицаОбрабатываемыхДокументов.ТекущийЭлемент;
	
	Если текКолонка.Имя = "ТаблицаОбрабатываемыхДокументовДокументПредставление" И ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
		СтандартнаяОбработка = Ложь;
		Парам = Новый Структура("Ключ", ТекущиеДанные.Документ);
		Форма = Неопределено;
		ОткрытьФорму("Документ.питДанныеПродажФронта.ФормаОбъекта", Парам,,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Если кассовый узел перезаписывается, то в этот момент необходимо обновить список касс на этой форме.
	Если ИмяСобытия = "питКассовыйУзелЗаписан" И Источник = "питОбновитьСписокКассККМ" Тогда
		ЗагрузитьПараметрыКассККМ();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВозможностьЗагрузкиДокументов(Команда)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация",Объект.Организация);
	ДополнительныеПараметры.Вставить("КассовыйУзел",Объект.КассовыйУзел);
	ДополнительныеПараметры.Вставить("ДатаНачалаОтбора",Объект.ДатаНачалаОтбора);
	ДополнительныеПараметры.Вставить("ДатаКонцаОтбора",Объект.ДатаКонцаОтбора);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОбработчикОповещения_ОбновитьСписокЗагружаемыхДокументов", ЭтотОбъект);
	ОткрытьФорму("Обработка.питЗагрузкаИзДанныхПродажФронта.Форма.ВозможностьЗагрузкиДПФ", ДополнительныеПараметры,ЭтотОбъект,,,,ОбработчикОповещения);
КонецПроцедуры

// Процедура - ОбработчикОповещения_ОбновитьСписокЗагружаемыхДокументов.
//
// Параметры:
//  РезультатОткрытияФормы	 - Произвольный - Результат открытия окна.
//  ДополнительныеПараметры	 - Структура - ДополнительныеПараметры
//
&НаКлиенте
Процедура ОбработчикОповещения_ОбновитьСписокЗагружаемыхДокументов(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	ЗаполнитьСписокДокументовДляЗагрузки();
КонецПроцедуры //ОбработчикОповещения_ОбновитьСписокЗагружаемыхДокументов.


ПересчитатьТаблицуДокументовИКасс = Ложь;
